title: Copy passwd From tmp Path
id: fa4aaed5-4fe0-498d-bbc0-08e3346387ba
status: experimental
description: Detects when the file passwd is copied from tmp path
references:
    - https://blogs.blackberry.com/
author: 'Joseliyo Sanchez @Joseliyo_Jstnk' 
date: 2023/01/11
tags:
    - attack.credential_access
    - attack.t1552.001
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|endswith: '/cp'
        CommandLine|contains|all:
            - '/tmp/'
            - 'passwd'
    condition: selection
falsepositives:
    - Red team
level: high