title: Touch Suspicious Service File
id: 31545105-3444-4584-bebf-c466353230d2
status: experimental
description: Detects touch process in service file.
references:
    - https://blogs.blackberry.com/
author: 'Joseliyo Sanchez @Joseliyo_Jstnk' 
date: 2023/01/11
tags:
    - attack.defense_evasion
    - attack.t1070.006
logsource:
    product: linux
    category: process_creation
detection:
    selection_touch:
        Image|endswith: '/touch'
        CommandLine|contains: '-t'
    selection_file:
        CommandLine|endswith: '.service'
    condition: selection_touch and selection_file
falsepositives:
    - Admin changing date of files.
level: medium